# Создать список, заменить первый элемент на [1, 2, 3], а в конец списка добавить сумму
# [1, 2, 3]
a = [1, 2, 3,]
b = [6, 3, 8, 1, 3, 5]
b.pop(0)
b.insert(0,a)
b.append(sum(a))
print(b)



# b = ['red', 'black']
# a = [1, 2, 'hello', b]
# a[3][1] = 'white'
# a.pop(3)
# print(a)
# print(b)